{
    "program_design": [
        {
            "id": 1,
            "title": "Daily Gratitude",
            "description": "This is where WE ARE DIFFERENT. We challenge users to be intentional about gratitude. Through a Daily Gratitude exercise the user starts their day grounding themselves in appreciation for the abundance they have in their life. We focus on those that have given so much to make this great nation. There are repeated scientific studies showing the mental health benefits to practicing gratitude. You will read incredible historical accounts across America's most pivotal moments. Maybe you'll even learn a little history, but you will certainly gain an appreciation for the resilience and grit of those that have come before us.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1609373119653-2b420e0b9acc?q=80&w=1634&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 2,
            "title": "Preparation and Planning",
            "description": "Where planning lacks, convenience reigns. Americans are slaves to convenience because we do not plan. When we make choices out of convenience, often times we are not making healthy choices. Commit 250 has the user take actionable steps across the week to plan and prepare for the upcoming trainig evolution. This allows users to account for meal planning, kids' schedules, work, and other commitments.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1484480974693-6ca0a78fb36b?q=80&w=1472&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 3,
            "title": "1 + 4 Training Design",
            "description": "This unique approach allows users to realistically achieve 250 days of training. Each prep week coincides with rest and recovery allowing users to learn the larger benefits of what is coming in the next training cycle. As an example, in one evolution users will schedule blood work if they do not have a recent test. They then proceed through the training evolution reading about each marker, its range, effects and ultimately what mitigations can be taken to improve that marker. Another evolution the same structured approach is taken with studying hormone health. During the 4 weeks of training, users have daily checklists to work through regarding exercise, nutrition, gratitude, and more. These checklists grow as users get more accustomed to the program.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1608228079968-c7681afb8f1d?q=80&w=1469&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 4,
            "title": "Habit Formation",
            "description": "The program is firmly grounded in the principles of habit formation, as outlined by Charles Duhigg in his seminal work, The Power of Habit (Duhigg, 2012), and draws heavily on the behavioral psychology insights provided by Atomic Habits (Clear, 2018). Using these and modern micro-learning practices we build lasting change through lasting habits.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1591311630200-ffa9120a540f?q=80&w=1110&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 5,
            "title": "Incremental Progress",
            "description": "Small, sustainable changes that compound over time, focusing on consistency rather than perfection. We challenge users to keep the schedule and avoid missing a day to keep users on track. The goal is to build the discipline necessary to maintain a healthy lifestyle. By emphasizing daily practice and incremental progress, the program aims to foster lasting behavioral change using daily reminders and notifications empowering users to achieve their personal development goals.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1531167599833-609a45d3d903?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 6,
            "title": "Targeted Health Education",
            "description": "Commit 250 provides short, micro-learning videos and articles that let users learn about their health daily. Each day of one of the evolutions blood test markers are studied in the context of what metabolic factors could be impacting that specific marker. Throughout the program we are educating users with short on-target education that is NOT a 2 hour podcast. We boil down the information for you.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1488190211105-8b0e65b80b4e?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 7,
            "title": "Community Support",
            "description": "Built-in accountability and support systems to help you stay motivated and on track with your goals. Users can stay connected with each other and share their progress.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1540474211005-7c8a448f69e6?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 8,
            "title": "Evidence-Based",
            "description": "All recommendations and strategies are grounded in scientific research and proven methodologies. We provide links to the research and studies that support our recommendations.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1560306990-18fa759c8713?q=80&w=1507&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 9,
            "title": "Non-Prescriptive",
            "description": "Everyone is different. Health is far more than diet and exercise. We provide a structure to build lasting habits. We will provide suggested diets and exercise programs, but what you pick is up to you. In the end, you must take on the consistency necessary to make the changes necessary and maintain them. We know that is done through positive habits, mental health, and a strong support system.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1691894493984-e4593dd394ec?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 10,
            "title": "Graduated Growth",
            "description": "With 250 days of training available, the program is designed to be flexible and adaptable to your needs, but it will add more each training evolution to learn more, train more, and become a better you. Just as everyone is different, most everyone has a different starting point. But our system is meant to meet any American where they are at and take them through increasing levels of education and challenge. The end product of 7 training evolutions across 250 days is a new and improved you.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1699298561597-0585ff611088?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        },
        {
            "id": 11,
            "title": "Americans First",
            "description": "While folks around the globe can benefit from this program, Commit 250 is not intended for other nations. We have studied the American lifestyle and how it is contributing to the US Health Crisis. Americans need the inspiration to act and the discipline to keep going. Our Daily Gratitude practices focus on American grit and greatness. We wrap up the last evolution and 'final 5' with civic actions that include volunteer work and learning about your local civics. Commit 250 is about making better citizens, focusing on Americans first.",
            "url": "",
            "image": "https://images.unsplash.com/photo-1532667491622-e56b2e4609c8?q=80&w=1925&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
            "duration": ""
        }
    ],
    "program_structure": [
        {
            "id": 1,
            "title": "Prep Week 1",
            "description": "Commitment, planning, coordination, studying, stretching and testing. You will be ready to go.",
            "duration": "1 week",
            "image": "/assets/images/prep-week-1.jpg",
            "url": ""
        },
        {
            "id": 2,
            "title": "Training Evolution 1",
            "description": "Foundation building and mindset development. Learn the core principles that will guide your health transformation journey.",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-1.jpg",
            "url": ""
        },
        {
            "id": 3,
            "title": "Prep Week 2", 
            "description": "Nutrition fundamentals and meal planning strategies. Discover how to fuel your body for optimal performance.",
            "duration": "1 week",
            "image": "/assets/images/prep-week-2.jpg",
            "url": ""
        },
        {
            "id": 4,
            "title": "Training Evolution 2", 
            "description": "Nutrition fundamentals and meal planning strategies. Discover how to fuel your body for optimal performance.",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-2.jpg",
            "url": ""
        },
        {
            "id": 5,
            "title": "Prep Week 3",
            "description": "",
            "duration": "1 week", 
            "image": "/assets/images/prep-week-3.jpg",
            "url": ""
        },
        {
            "id": 6,
            "title": "Training Evolution 3",
            "description": "Strength training basics and form mastery. Build a solid foundation of movement patterns and strength.",
            "duration": "4 weeks", 
            "image": "/assets/images/evolution-3.jpg",
            "url": ""
        },
        {
            "id": 7,
            "title": "Prep Week 4",
            "description": "",
            "duration": "1 week",
            "image": "/assets/images/prep-week-4.jpg",
            "url": ""
        },
        {
            "id": 8,
            "title": "Training Evolution 4",
            "description": "",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-4.jpg",
            "url": ""
        },
        {
            "id": 9,
            "title": "Prep Week 5",
            "description": "",
            "duration": "1 week",
            "image": "/assets/images/prep-week-5.jpg",
            "url": ""
        },
        {
            "id": 10,
            "title": "Training Evolution 5",
            "description": "",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-5.jpg",
            "url": ""
        },
        {
            "id": 11,
            "title": "Prep Week 6",
            "description": "",
            "duration": "1 week",
            "image": "/assets/images/prep-week-6.jpg",
            "url": ""
        },
        {
            "id": 12,
            "title": "Training Evolution 6",
            "description": "",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-6.jpg",
            "url": ""
        },
        {
            "id": 13,
            "title": "Prep Week 7",
            "description": "",
            "duration": "1 week",
            "image": "/assets/images/prep-week-7.jpg",
            "url": ""
        },
        {
            "id": 14,
            "title": "Training Evolution 7",
            "description": "",
            "duration": "4 weeks",
            "image": "/assets/images/evolution-7.jpg",
            "url": ""
        },
        {
            "id": 15,
            "title": "Final 5",
            "description": "",
            "duration": "5 days",
            "image": "/assets/images/final-5.jpg",
            "url": ""
        }
    ],
    "program_faq": [
        {
            "id": 1,
            "title": "Is this a diet program?",
            "description": "No, Commit 250 is not a diet program. We provide education and resources to help you make informed decisions about nutrition, but we don't prescribe specific meal plans.",
            "url": "",
            "image": "/assets/images/faq-diet.jpg",
            "duration": ""
        },
        {
            "id": 2,
            "title": "Do I need to work out every day?",
            "description": "The program is designed to be flexible. We provide suggested training options, but you can adapt them to your schedule and fitness level.",
            "url": "",
            "image": "/assets/images/faq-workout.jpg",
            "duration": ""
        },
        {
            "id": 3,
            "title": "How long does the program take?",
            "description": "The program is designed for 250 days, but you can progress at your own pace. The key is consistency, not speed. We provide a framework to help users build habits that stick. If you stick with it, it will be shocking how far you can actually take yourself.",
            "url": "",
            "image": "/assets/images/faq-timeline.jpg",
            "duration": ""
        },
        {
            "id": 4,
            "title": "What if I miss a day?",
            "description": "Life happens! The program is designed to be forgiving. Use the 3 day grace period and gain the flexibility you need.",
            "url": "",
            "image": "/assets/images/faq-missed-day.jpg",
            "duration": ""
        },
        {
            "id": 5,
            "title": "Is there community support?",
            "description": "Yes! We have a supportive community of like-minded individuals who are also on their health transformation journey.",
            "url": "",
            "image": "/assets/images/faq-community.jpg",
            "duration": ""
        },
        {
            "id": 6,
            "title": "Is this another biohacking program, am I going to have to buy a cold plunge or a hyperbaric chamber?",
            "description": "No. Read about the What We Are Not.",
            "url": "/what-we-are-not",
            "image": "/assets/images/faq-what-we-are-not.jpg",
            "duration": ""
        },
        {
            "id": 7,
            "title": "What diet are you recommending?",
            "description": "We have a few diets we recommend based upon established research. The key is to develop the discipline to stick to it. We are not prescriptive on which program you choose, but we help you stick to it.",
            "url": "",
            "image": "/assets/images/faq-what-we-are-not.jpg",
            "duration": ""
        },
        {
            "id": 7,
            "title": "What do I get if I sign up?",
            "description": "If you sign up before the app is available for download, you will not be charged at the time the app is available, and you will access to premium content on the website.",
            "url": "",
            "image": "/assets/images/faq-what-we-are-not.jpg",
            "duration": ""
        },
        {
            "id": 8,
            "title": "Do I need the app?",
            "description": "You can piece together the program from what information you find here and the articles you find on the site. But the structure, integration with notfications/reminders, and the community support are all built into the app.",
            "url": "",
            "image": "/assets/images/faq-what-we-are-not.jpg",
            "duration": ""
        },
        {
            "id": 9,
            "title": "Do I have to complete the 250 days before July 4, 2026?",
            "description": "No. In fact, you can complete it any time. We want to get as many Americans moving as possible to make July 4, 2026 a goal date to celebrate their improved health. We designed the program to encompass 250 days so that it can live beyond the 250th anniversary. Our goal is that folks can be doing this program well beyond the 250th anniversary. We want to transform 1 million Americans lives to combat this US Health Crisis.",
            "url": "",
            "image": "/assets/images/faq-what-we-are-not.jpg",
            "duration": ""
        },
        {
            "id": 10,
            "title": "Why does it cost money, so many of my other apps are free?",
            "description": "We DO NOT SELL YOUR DATA. Your data is yours. We do not sell your data or information to third parties. To be able to cover the costs associated with hosting the app and website, we have to charge a small fee. $2.50/mo is a very reasonable price for the value you will receive.",
            "url": "/your-data",
            "image": "/assets/images/faq-your-data.jpg",
            "duration": ""
        }
    ]
} 